# vsoWidgetGetVisible

## Description
```pascal
FUNCTION vsoWidgetGetVisible(widgetID : LONGINT) : BOOLEAN;
```

```python

def vs.vsoWidgetGetVisible(widgetID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|widgetID|LONGINT||

## Version
Availability: from Vectorworks 2011
## Category
* Object Events